Repository: ykreo/NetPulse
Catalog: NetPulse/Resources/Localizable.xcstrings
Source language: en
Languages: ru

source: A simple macOS menu bar utility for monitoring and managing your home network.
ru: Простая утилита для строки меню macOS для мониторинга и управления домашней сетью.

# About
source: About NetPulse
ru: О программе NetPulse

source: Action Parameters
ru: Параметры действия

source: Actions (SSH Commands)
ru: Действия (SSH Команды)

source: Add
ru: Добавить

source: Add new action
ru: Добавить новое действие

source: Always
ru: Всегда

source: Application Behavior
ru: Поведение приложения

source: Automatic Check
ru: Проверять автоматически

source: Automatically launch NetPulse when you log into macOS.
ru: Автоматически запускать NetPulse при входе в macOS.

source: ✅ Back online
ru: ✅ Снова в сети

source: Background Check Interval
ru: Интервал фоновой проверки

source: Basic Parameters
ru: Основные параметры

source: Button Title:
ru: Название кнопки:

source: Cancel
ru: Отмена

source: Change...
ru: Изменить...

source: Check for a new version on GitHub right now.
ru: Проверить наличие новой версии на GitHub прямо сейчас.

source: Check for updates on application startup.
ru: Проверять наличие обновлений при запуске приложения.

source: Check Now
ru: Проверить сейчас

source: Checking...
ru: Проверка...

source: command successfully sent.
ru: команда успешно отправлена.

source: Configuration Management
ru: Управление конфигурацией

source: Configure your monitoring devices and application settings
ru: Настройте устройства для мониторинга и параметры приложения

source: Copyright © 2025 ykreo. All rights reserved.
ru: Copyright © 2025 ykreo. Все права защищены.

source: Could not connect to the GitHub server. Please check your internet connection.
ru: Не удалось связаться с сервером GitHub. Пожалуйста, проверьте ваше интернет-соединение.

source: Current Version
ru: Текущая версия

source: Device Icon:
ru: Иконка устройства:

source: Device Name:
ru: Имя устройства:

source: Devices
ru: Устройства

source: Display
ru: Отображение

source: Distributed under the MIT License.
ru: Распространяется по лицензии MIT.

source: Done
ru: Готово

source: Download
ru: Загрузить

source: Edit
ru: Править

source: Editing Action
ru: Редактирование действия

source: Editing Device
ru: Редактирование устройства

source: Error
ru: Ошибка

source: Executing...
ru: Выполняется...

source: Exit
ru: Выход

source: Export...
ru: Экспорт...

source: Failed to connect:
ru: Не удалось подключиться:

source: General
ru: Общие

source: Get automatic status change notifications.
ru: Автоматические уведомления об изменениях.

source: Hide Dock Icon
ru: Скрывать иконку в Dock

source: Host (IP or domain):
ru: Хост (IP или домен):

source: Host and User fields cannot be empty.
ru: Поля «Хост» и «Пользователь» не могут быть пустыми.

source: How often to check device statuses in the background.
ru: Как часто проверять статус устройств в фоне.

source: Icon:
ru: Иконка:

source: If Offline
ru: Если офлайн

source: If Online
ru: Если онлайн

source: Import & Export
ru: Импорт и экспорт

source: Import...
ru: Импорт...

source: Internet
ru: Интернет

source: Internet Check Host
ru: Хост для проверки интернета

source: IP/domain to check internet availability.
ru: IP/домен для проверки доступности интернета.

source: Later
ru: Позже

source: Launch at login
ru: Запускать при входе

source: Manual Check
ru: Ручная проверка

source: Network Monitoring
ru: Мониторинг сети

source: Network Parameters
ru: Общие параметры сети

source: New Device
ru: Новое устройство

source: New version available!
ru: Доступна новая версия!

source: No updates found
ru: Обновлений не найдено

source: Notifications
ru: Уведомления

source: Offline
ru: Офлайн

source: Online
ru: Онлайн

source: Open project repository
ru: Открыть репозиторий проекта

source: Open Settings
ru: Открыть настройки

source: Please add devices and configure SSH keys to begin monitoring.
ru: Пожалуйста, добавьте устройства и настройте SSH-ключи для начала мониторинга.

source: Private key for authorization on devices.
ru: Приватный ключ для авторизации на устройствах.

source: Reboot
ru: Перезагрузка

source: Remotely manage your devices via SSH.
ru: Удаленное управление устройствами через SSH.

source: Remotely power on your computer.
ru: Удаленное включение компьютера.

source: Remove selected action
ru: Удалить выбранное действие

source: Reset
ru: Сбросить

source: Reset Settings
ru: Сброс настроек

source: Restart
ru: Перезапустить

source: Restart is required
ru: Требуется перезапуск

source: Restore all settings to their default values.
ru: Восстановить все настройки до исходных значений.

source: Save
ru: Сохранить

source: Save and load all application settings.
ru: Сохранение и загрузка всех настроек приложения.

source: sec
ru: сек

source: Settings
ru: Настройки

source: Show Button:
ru: Показывать кнопку:

source: Show the application only in the menu bar.
ru: Показывать приложение только в строке меню.

source: Shutdown
ru: Выключение

source: SSH Command:
ru: SSH Команда:

source: SSH connection successful!
ru: SSH-соединение успешно установлено!

source: SSH Control
ru: SSH управление

source: SSH Key Path
ru: Путь к SSH ключу

source: SSH key path is invalid.
ru: Путь к SSH ключу недействителен.

source: SSH User:
ru: Пользователь SSH:

source: Status changed
ru: изменил статус

source: Success
ru: Успех

source: The currently installed version of NetPulse.
ru: Установленная в данный момент версия NetPulse.

source: To apply the changes for the Dock icon, NetPulse needs to be restarted.
ru: Чтобы изменения для иконки в Dock вступили в силу, необходимо перезапустить NetPulse.

source: Track the status of your router, computer, and internet.
ru: Отслеживание статуса роутера, компьютера и интернета.

# Unconfigured
source: Configuration Required
ru: Требуется настройка

source: Unexpected response received:
ru: Получен неожиданный ответ:

source: Update Check Error
ru: Ошибка проверки обновлений

source: Updates
ru: Обновления

source: Version %@ is available. Would you like to download it now?
ru: Найдена версия %@. Хотите загрузить ее сейчас?

source: Wake Up
ru: Включить

source: ❌ Went offline
ru: ❌ Ушел в офлайн

source: What's new:
ru: Что нового:

source: You have the latest version of NetPulse installed.
ru: У вас установлена самая свежая версия NetPulse.
